public class Identifiers {
    public static void main(String[] args) {
        /*
        1. Объявить переменные, необходимые для вычисления площади прямоугольника.
         2. Объявить переменные, необходимые для вычисления объема комнаты.
         3. Объявить переменные, необходимые для вычисления  массы куба.
         4. Объявить переменные, необходимые для пересчета веса из фунтов в килограммы.
         5. Объявить переменные, необходимые для вычисления площади кольца.
         6. Объявить переменные, необходимые для вычисления стоимости покупки, состоящей из нескольких тетрадей,
         карандашей и линейки
         7. В программе нужно зафиксировать какое-то состояние
         8. После выполнения определенного этапа в работе программы установить флаг
         9. Проверить, соблюдается ли определенное логическое условие
         10. Определить код символа в таблице символов
         11. Задать произвольные букву и строку
         12. Масса электрона равна 9,1093837015⋅10^−31 кг
         13. Масса Земли равна 5.972⋅10^24 кг
         14. Популяция Земли равна 7.674 миллиардов
         15. При нажатии на кнопку загорается светодиод
         16. Цифру числа нужно преобразовать в букву
         */

        double width, height, square;
        double a, b;
        double length2, width2, height2, volume;
        double ro, mass;
        double massPound, massKg;
        double total, costCopyBook, countCopyBook;
        int state;
        boolean state2;

        double me = 9.1093837015e-31;
        double massEarth = 5.972e24;
        long populationEarth = 7_674_646_464_646l;
        boolean button, led, lamp;
        int number, digit;
        char letter='a';
        String s = null;
        System.out.println(s);
    }
}
